Autodesk.Revit.DB.ExternalResourceLoadContext.CallingDocumentHasModelPath
Indicates whether the document requesting the external resource has a defined
ModelPath.
Remarks:
A project that is detached, or has not been saved to disk yet, will not have a ModelPath.
Returns:
True if the document has a defined ModelPath.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContext.GetCallingDocumentModelPath
Returns a copy of the ModelPath of the document that is requesting
the external resource.
Returns:
A copy of the ModelPath of the document that is requesting the external
resource.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document requesting the external resource does not have a ModelPath, either because
it is detached, or because it has not been saved to disk yet.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContext.GetCurrentlyLoadedReference
Returns a copy of the ExternalResourceReference currently
in use by the containing element.
Remarks:
A server may use to wish this information to, for example,
tell whether the Revit user was previously using their
server or not.
This reference may be null if there is no current
value. For example, a newly-created link being loaded for the first
time would have no currently-loaded reference.
Returns:
A copy of the ExternalResourceReference currently in use
by the containing element.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContext.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceLoadContext.LoadOperationType
An enum value indicating whether the resource load was triggered by an
automatic event (such as file open) or an explicit user action.
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContext
This class contains data describing the context related
to an external resource load operation.
Remarks:
Note that automatic loads can occur in the context of other operations such as opening a file.
During automatic loads, it is therefore recommended that the server only display UI that is critical
for the user to see (such as error message).
The loading operation type is Explicit when the user is specifically trying to reload the resource.
During explicit loads, it may be desirable to provide more feedback to the user, such as specific feedback
that the load operation succeeded.
Since:
2015